Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/MCI_STM32F4xx.c
  #if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
    /* Configure pins */
    for (i = 0; i < sizeof (mci_io) / sizeof (mci_io[0]); i++) {
      Enable_GPIO_Clock (mci_io[i].port);

      GPIO_InitStruct.Pin       = mci_io[i].pin;
      GPIO_InitStruct.Pull      = mci_io[i].pull;
      GPIO_InitStruct.Alternate = mci_io[i].af;

      GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;

      HAL_GPIO_Init(mci_io[i].port, &GPIO_InitStruct);
    }

    /* Configure CD (Card Detect) Pin */
    #if defined (MX_MemoryCard_CD_Pin)
      Enable_GPIO_Clock (MX_MemoryCard_CD_GPIOx);

      GPIO_InitStruct.Pin  = MX_MemoryCard_CD_GPIO_Pin;
      GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
      GPIO_InitStruct.Pull = MX_MemoryCard_CD_GPIO_PuPd;
      HAL_GPIO_Init(MX_MemoryCard_CD_GPIOx, &GPIO_InitStruct);
    #endif

    /* Configure WP (Write Protect) Pin */
    #if defined (MX_MemoryCard_WP_Pin)
      Enable_GPIO_Clock (MX_MemoryCard_WP_GPIOx);

      GPIO_InitStruct.Pin  = MX_MemoryCard_WP_GPIO_Pin;
      GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
      GPIO_InitStruct.Pull = MX_MemoryCard_WP_GPIO_PuPd;
      HAL_GPIO_Init(MX_MemoryCard_WP_GPIOx, &GPIO_InitStruct);
    #endif

    /* Enable IO compensation cell */
    RCC->APB2ENR  |=  RCC_APB2ENR_SYSCFGEN;
    SYSCFG->CMPCR |= SYSCFG_CMPCR_CMP_PD;
    while ((SYSCFG->CMPCR & SYSCFG_CMPCR_READY) == 0U) {
      __NOP(); /* Wait until compensation cell ready */
    }

    /* Enable DMA peripheral clock */
    __HAL_RCC_DMA2_CLK_ENABLE();

    /* Configure DMA receive stream */
    hdma_sdio_rx.Instance                 = MX_SDIO_RX_DMA_Instance;
    hdma_sdio_rx.Init.Channel             = MX_SDIO_RX_DMA_Channel;
    hdma_sdio_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    hdma_sdio_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hdma_sdio_rx.Init.MemInc              = DMA_MINC_ENABLE;
    hdma_sdio_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    hdma_sdio_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    hdma_sdio_rx.Init.Mode                = DMA_PFCTRL;
    hdma_sdio_rx.Init.Priority            = MX_SDIO_RX_DMA_Priority;
    hdma_sdio_rx.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
    hdma_sdio_rx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    hdma_sdio_rx.Init.MemBurst            = DMA_MBURST_INC4;
    hdma_sdio_rx.Init.PeriphBurst         = DMA_PBURST_INC4;

    if (HAL_DMA_Init(&hdma_sdio_rx) != HAL_OK) {
      return ARM_DRIVER_ERROR;
    }

    /* Configure DMA transmit stream */
    hdma_sdio_tx.Instance                 = MX_SDIO_TX_DMA_Instance;
    hdma_sdio_tx.Init.Channel             = MX_SDIO_TX_DMA_Channel;
    hdma_sdio_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    hdma_sdio_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hdma_sdio_tx.Init.MemInc              = DMA_MINC_ENABLE;
    hdma_sdio_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    hdma_sdio_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    hdma_sdio_tx.Init.Mode                = DMA_PFCTRL;
    hdma_sdio_tx.Init.Priority            = MX_SDIO_TX_DMA_Priority;
    hdma_sdio_tx.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
    hdma_sdio_tx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    hdma_sdio_tx.Init.MemBurst            = DMA_MBURST_INC4;
    hdma_sdio_tx.Init.PeriphBurst         = DMA_PBURST_INC4;

    if (HAL_DMA_Init(&hdma_sdio_tx) != HAL_OK) {
      return ARM_DRIVER_ERROR;
    }
  #else
    hsd.Instance = SDIO;
  #endif

  /* Set DMA callback function */
  hdma_sdio_rx.XferCpltCallback  = &RX_DMA_Complete;

  /* Clear control structure */
  memset (&MCI, 0, sizeof (MCI_INFO));

  MCI.cb_event = cb_event;
  MCI.flags    = MCI_INIT;

  return ARM_DRIVER_OK;
}


/**
  \fn            int32_t Uninitialize (void)
  \brief         De-initialize Memory Card Interface.
  \return        \ref execution_status
*/
static int32_t Uninitialize (void) {
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
  uint32_t i;
#endif
  MCI.flags = 0U;

  #if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
    hsd.Instance = NULL;
  #endif

  #if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
    /* Unconfigure pins */
    for (i = 0; i < sizeof (mci_io) / sizeof (mci_io[0]); i++) {
      HAL_GPIO_DeInit(mci_io[i].port, mci_io[i].pin);
    }
  #endif /* RTE_DEVICE_FRAMEWORK_CLASSIC */

  #if defined (MX_MemoryCard_CD_Pin)
    /* Unconfigure CD (Card Detect) Pin */
    HAL_GPIO_DeInit (MX_MemoryCard_CD_GPIOx, MX_MemoryCard_CD_GPIO_Pin);
  #endif

  #if defined (MX_MemoryCard_WP_Pin)
    /* Unconfigure WP (Write Protect) Pin */
    HAL_GPIO_DeInit (MX_MemoryCard_WP_GPIOx, MX_MemoryCard_WP_GPIO_Pin);
  #endif

  return ARM_DRIVER_OK;
}


/**
  \fn            int32_t PowerControl (ARM_POWER_STATE state)
  \brief         Control Memory Card Interface Power.
  \param[in]     state   Power state \ref ARM_POWER_STATE
  \return        \ref execution_status
*/
static int32_t PowerControl (ARM_POWER_STATE state) {
  int32_t status;

  if ((state != ARM_POWER_OFF)  && 
      (state != ARM_POWER_FULL) && 
      (state != ARM_POWER_LOW)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  status = ARM_DRIVER_OK;

  switch (state) {
    case ARM_POWER_OFF:
      /* Reset/Dereset SDIO peripheral */
      __HAL_RCC_SDIO_FORCE_RESET();
      __NOP(); __NOP(); __NOP(); __NOP();
      __HAL_RCC_SDIO_RELEASE_RESET();

      #if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
        /* Disable SDIO interrupts in NVIC */
        HAL_NVIC_DisableIRQ (SDIO_IRQn);

        /* Disable DMA stream interrupts in NVIC */
        if (hdma_sdio_rx.Instance != NULL) {
          HAL_NVIC_DisableIRQ (SDIO_RX_DMA_IRQn);
        }
        if (hdma_sdio_tx.Instance != NULL) {
          HAL_NVIC_DisableIRQ (SDIO_TX_DMA_IRQn);
        }

        /* Disable DMA stream */
        if (hdma_sdio_rx.Instance != NULL) {
          if (HAL_DMA_DeInit (&hdma_sdio_rx) != HAL_OK) {
            status = ARM_DRIVER_ERROR;
          }
        }
        if (hdma_sdio_tx.Instance != NULL) {
          if (HAL_DMA_DeInit (&hdma_sdio_tx) != HAL_OK) {
            status = ARM_DRIVER_ERROR;
          }
        }

        /* SDIO peripheral clock disable */
        __HAL_RCC_SDIO_CLK_DISABLE();
      #else
        if (hsd.Instance != NULL) {
          HAL_SD_MspDeInit (&hsd);
        }
      #endif

      /* Clear status */
      MCI.status.command_active   = 0U;
      MCI.status.command_timeout  = 0U;
      MCI.status.command_error    = 0U;
      MCI.status.transfer_active  = 0U;
      MCI.status.transfer_timeout = 0U;
      MCI.status.transfer_error   = 0U;
      MCI.status.sdio_interrupt   = 0U;
      MCI.status.ccs              = 0U;

      MCI.flags &= ~MCI_POWER;
      break;

    case ARM_POWER_FULL:
      if ((MCI.flags & MCI_INIT)  == 0U) {
        return ARM_DRIVER_ERROR;
      }
      if ((MCI.flags & MCI_POWER) != 0U) {
        return ARM_DRIVER_OK;
      }
      #if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
        HAL_SD_MspInit (&hsd);
      #else
        /* Enable SDIO peripheral clock */
        __HAL_RCC_SDIO_CLK_ENABLE();
      #endif

      /* Clear response and transfer variables */
      MCI.response = NULL;
      MCI.xfer.cnt = 0U;

